//----------------------------------------------------------------------------
//
//	エラーリスト
//
//														 制作者：劉喆
//                                                       作成日：2018/02/13
//----------------------------------------------------------------------------

#ifndef ERROR_LIST_H
#define ERROR_LIST_H

//---------------------------インクルード-------------------------------------

//---------------------------マクロ定義---------------------------------------

//---------------------------列挙型定義---------------------------------------
typedef enum {
	ELW_ROOM_NOT_EXIST,
	ELW_NAME_SIZE_OVER,
	ELW_NAME_SIZE_ZERO,
	ELW_MAX
}ERROR_LIST_WORD;

//---------------------------構造体定義---------------------------------------

//---------------------------グローバル変数-----------------------------------

//---------------------------プロトタイプ宣言---------------------------------
void InitErrorList();
void UninitErrorList();
void UpdateErrorList();
void DrawErrorList();

void SetErrorList(int nErrorNum, int nType);

bool GetErrorListStatus();

#endif // !ERROR_LIST_H
