//----------------------------------------------------------------------------
//
//	ゲームの終わり時点の評価
//
//														 制作者：劉喆
//                                                       作成日：2018/01/16
//----------------------------------------------------------------------------

#ifndef GAME_ACHIEVEMENT_H
#define	GAME_ACHIEVEMENT_H

//---------------------------インクルード-------------------------------------

//---------------------------マクロ定義---------------------------------------

//---------------------------列挙型定義---------------------------------------

//---------------------------構造体定義---------------------------------------

//---------------------------グローバル変数-----------------------------------

//---------------------------プロトタイプ宣言---------------------------------
void InitGameAchievementClearFailed();
void UninitGameAchievementClearFailed();
void UpdateGameAchievementClearFailed();
void DrawGameAchievementClearFailed();

//------------------------------------------------------------------------------
//	関数名:	SetClearFailedStatus
//	引数:	なし
//	戻り値:	なし
//	説明:	クリア/失敗の状態を設定する
//------------------------------------------------------------------------------
void SetClearFailedStatus();

bool GetClearFailedStatus();

void InitGameAchievementFCAP();
void UninitGameAchievementFCAP();
void UpdateGameAchievementFCAP();
void DrawGameAchievementFCAP();

//------------------------------------------------------------------------------
//	関数名:	SetFCAP
//	引数:	なし
//	戻り値:	なし
//	説明:	FC / APの状態を設定する
//------------------------------------------------------------------------------
void SetFCAP();

bool GetFCAP();

#endif // !GAME_ACHIEVEMENT_H
