//----------------------------------------------------------------------------
//
//	ゲージ
//
//														 制作者：劉喆
//                                                       作成日：2017/12/23
//----------------------------------------------------------------------------

#ifndef GAUGE_H
#define GAUGE_H

//---------------------------インクルード-------------------------------------

//---------------------------マクロ定義---------------------------------------

//---------------------------列挙型定義---------------------------------------

//---------------------------構造体定義---------------------------------------

//---------------------------グローバル変数-----------------------------------

//---------------------------プロトタイプ宣言---------------------------------
void InitGauge();
void UninitGauge();
void UpdateGauge();
void DrawGauge();

//------------------------------------------------------------------------------
//	関数名:	SetGaugeNum
//	引数:	音符種類　判定レベル
//	戻り値:	なし
//	説明:	指定した音符種類と判定レベルに対応していたゲージ値を加算する
//------------------------------------------------------------------------------
void SetGaugeNum(int nNoteType, int nJudgeLevel);

//------------------------------------------------------------------------------
//	関数名:	GetClearStatus
//	引数:	なし
//	戻り値:	クリア/失敗の状態
//	説明:	現時点のクリア状態を取得する
//------------------------------------------------------------------------------
bool GetClearStatus();

void InitGaugeBoard();
void UninitGaugeBoard();
void UpdateGaugeBoard();
void DrawGaugeBoard();

void InitGaugeBG();
void UninitGaugeBG();
void UpdateGaugeBG();
void DrawGaugeBG();

void InitGaugeClearLine();
void UninitGaugeClearLine();
void UpdateGaugeClearLine();
void DrawGaugeClearLine();

void ResetGauge();

#endif // !GAUGE_H

