//----------------------------------------------------------------------------
//
//	判定ライン
//
//														 制作者：劉喆
//                                                       作成日：2017/11/30
//----------------------------------------------------------------------------

#ifndef JUDGE_LINE_H
#define JUDGE_LINE_H
//---------------------------マクロ定義---------------------------------------
#define JUDGE_LINE_Z					(-300.0f)

//---------------------------列挙型定義---------------------------------------

//---------------------------プロトタイプ宣言---------------------------------
void InitJudgeLine();
void UninitJudgeLine();
void UpdateJudgeLine();
void DrawJudgeLine();

void UpdateJudgeLineSpecial();
void DrawJudgeLineSpecial();

#endif // !JUDGE_LINE_H
