//----------------------------------------------------------------------------
//
//	判定音
//
//														 制作者：劉喆
//                                                       作成日：2017/12/14
//----------------------------------------------------------------------------

#ifndef JUDGE_SOUND_H
#define JUDGE_SOUND_H
#include "sound.h"

//---------------------------インクルード-------------------------------------

//---------------------------マクロ定義---------------------------------------

//---------------------------列挙型定義---------------------------------------
typedef enum {
	JSL_TAP,
	JSL_BREAK,
	JSL_HOLD_START,
	JSL_HOLD_MIDDLE,
	JSL_HOLD_END,
	JSL_FLICK,
	JSL_SLIDE_START,
	JSL_SLIDE_MIDDLE,
	JSL_SLIDE_END,
	JSL_MAX
}JUDGE_SOUND_LIST;

//---------------------------構造体定義---------------------------------------

//---------------------------グローバル変数-----------------------------------

//---------------------------プロトタイプ宣言---------------------------------
void InitJudgeSound();
void UninitJudgeSound();
void UpdateJudgeSound();

//------------------------------------------------------------------------------
//	関数名:	SetJudgeSound
//	引数:	判定音の番号　再生状態
//	戻り値:	なし
//	説明:	判定音の再生状態を指定する
//------------------------------------------------------------------------------
void SetJudgeSound(int nJudgeSound, bool bStatus);

//------------------------------------------------------------------------------
//	関数名:	SetJudgeSoundVolume
//	引数:	音量の変化値
//	戻り値:	なし
//	説明:	判定音の音量を変更する
//------------------------------------------------------------------------------
void SetJudgeSoundVolume(int nAdd);

//------------------------------------------------------------------------------
//	関数名:	GetJudgeSoundVolume
//	引数:	なし
//	戻り値:	判定音の音量
//	説明:	判定音の音量を取得する
//------------------------------------------------------------------------------
int GetJudgeSoundVolume();

#endif // !JUDGE_SOUND_H

