//----------------------------------------------------------------------------
//
//	判定部分
//
//														 制作者：劉喆
//                                                       作成日：2017/12/03
//----------------------------------------------------------------------------

#ifndef JUDGE_H
#define JUDGE_H

//---------------------------マクロ定義---------------------------------------

//---------------------------列挙型定義---------------------------------------
typedef enum {
	JL_PERFECT_JUST,
	JL_PERFECT,
	JL_GOOD,
	JL_BAD,
	JL_MAX
}JUDGELEVEL;						// 判定レベル

//---------------------------プロトタイプ宣言---------------------------------
void InitJudge();
void UninitJudge();
void UpdateJudge();
void DrawJudge();

//------------------------------------------------------------------------------
//	関数名:	GetJudgeLevelDetail
//	引数:	判定レベル
//	戻り値:	判定数
//	説明:	指定した判定レベルの判定数を取得する
//------------------------------------------------------------------------------
int GetJudgeLevelDetail(int nJudgeLevel);

//------------------------------------------------------------------------------
//	関数名:	GetJudgeLevelAll
//	引数:	なし
//	戻り値:	判定数の和
//	説明:	判定数の和を取得する
//------------------------------------------------------------------------------
int GetJudgeLevelAll();

#endif // !JUDGE_H