//----------------------------------------------------------------------------
//
//	判定エフェクト
//
//														 制作者：劉喆
//                                                       作成日：2017/12/29
//----------------------------------------------------------------------------

#ifndef JUDGE_EFFECT_H
#define JUDGE_EFFECT_H
//---------------------------インクルード-------------------------------------

//---------------------------マクロ定義---------------------------------------

//---------------------------列挙型定義---------------------------------------
typedef enum {
	JES_UNDER,
	JES_UP,
	JES_MAX,
}JUDGE_EFFECT_SECTION;
//---------------------------構造体定義---------------------------------------

//---------------------------グローバル変数-----------------------------------

//---------------------------プロトタイプ宣言---------------------------------
void InitJudgeEffect();
void UninitJudgeEffect();
void UpdateJudgeEffect();
void DrawJudgeEffect();

//------------------------------------------------------------------------------
//	関数名:	SetJudgeEffect
//	引数:	レーン番号　音符種類　判定レベル　エフェクト部分　状態　方向
//	戻り値:	なし
//	説明:	判定エフェクトを設定する
//------------------------------------------------------------------------------
void SetJudgeEffect(int nLane, int nNoteType, int nJudgeLevel, int nParts, bool bStatus = true, int nDirect = -1);

#endif // !JUDGE_EFFECT_H
