//----------------------------------------------------------------------------
//
//	レーン
//
//														 制作者：劉喆
//                                                       作成日：2017/11/29
//----------------------------------------------------------------------------

#ifndef LANE_H
#define LANE_H
//---------------------------マクロ定義---------------------------------------

//---------------------------列挙型定義---------------------------------------

//---------------------------プロトタイプ宣言---------------------------------
void InitLane();
void UninitLane();
void UpdateLane();
void DrawLane();

void InitLaneEffect();
void UninitLaneEffect();
void UpdateLaneEffect();
void DrawLaneEffect();

#endif // !LANE_H
