#ifndef RENDER_STATE_H
#define RENDER_STATE_H

//------------------------------------------------------------------------------
//	関数名:	SetUVSTA
//	引数:	D3DTADDRESS_WRAPなど
//	戻り値:	なし
//	説明:	テクスチャUVの描画方式の設定
//------------------------------------------------------------------------------
void SetUVSTA(int nType);

//------------------------------------------------------------------------------
//	関数名:	SetBlend
//	引数:	D3DBLEND_INVSRCALPHAなど
//	戻り値:	なし
//	説明:	色の描画方式の設定
//------------------------------------------------------------------------------
void SetBlend(int nType);

//------------------------------------------------------------------------------
//	関数名:	SetCullMode
//	引数:	D3DCULL_NONE D3DCULL_CW D3DCULL_CCW	D3DCULL_FORCE_DWORD
//	戻り値:	なし
//	説明:	3Dポリゴンの描画方式の設定
//------------------------------------------------------------------------------
void SetCullMode(int nType);

//------------------------------------------------------------------------------
//	関数名:	SetAlphaTest
//	引数:	状態　α値
//	戻り値:	なし
//	説明:	3Dポリゴンの描画方式の設定
//------------------------------------------------------------------------------
void SetAlphaTest(bool bStatus, int nA);

//------------------------------------------------------------------------------
//	関数名:	SetZBuffer
//	引数:	状態
//	戻り値:	なし
//	説明:	3Dポリゴンの描画方式の設定
//------------------------------------------------------------------------------
void SetZBuffer(bool bStatus);

#endif // !RENDER_STATE_H
