//----------------------------------------------------------------------------
//
//	ゲーム設定
//
//														 制作者：劉喆
//                                                       作成日：2018/01/18
//----------------------------------------------------------------------------

#ifndef SETTING_H
#define SETTING_H

//---------------------------インクルード-------------------------------------

//---------------------------マクロ定義---------------------------------------

//---------------------------列挙型定義---------------------------------------

//---------------------------構造体定義---------------------------------------

//---------------------------グローバル変数-----------------------------------

//---------------------------プロトタイプ宣言---------------------------------
void InitSetting();
void UninitSetting();
void UpdateSetting();
void DrawSetting();

bool GetSettingStatus();

void InitSettingBoard();
void UninitSettingBoard();
void UpdateSettingBoard();
void DrawSettingBoard();

//------------------------------------------------------------------------------
//	関数名:	SetSettingBoard
//	引数:	変化させる座標
//	戻り値:	なし
//	説明:	設定画面の目標座標を設定する
//------------------------------------------------------------------------------
void SetSettingBoard(D3DXVECTOR2 vAddPos);

void InitSettingArrow();
void UninitSettingArrow();
void UpdateSettingArrow();
void DrawSettingArrow(); 

void InitSettingManual();
void UninitSettingManual();
void UpdateSettingManual();
void DrawSettingManual();

//------------------------------------------------------------------------------
//	関数名:	SetSettingManualA
//	引数:	変化させるα値
//	戻り値:	なし
//	説明:	設定項目の説明の目標α値を設定する
//------------------------------------------------------------------------------
void SetSettingManualA(int nType);

//------------------------------------------------------------------------------
//	関数名:	GetMusicVolume
//	引数:	なし
//	戻り値:	音楽の音量
//	説明:	音楽の音量を取得する
//------------------------------------------------------------------------------
float GetMusicVolume();

#endif // !SETTING_H

