//----------------------------------------------------------------------------
//
//	テストモード
//
//														 制作者：劉喆
//                                                       作成日：2018/01/19
//----------------------------------------------------------------------------

#ifndef TEST_MODE_H
#define TEST_MODE_H

//---------------------------インクルード-------------------------------------

//---------------------------マクロ定義---------------------------------------

//---------------------------列挙型定義---------------------------------------
typedef enum {
	TMML_GUEST,
	TMML_NETWORK,
	TMML_DEMO,
	TMML_XINPUT,
	TMML_EDIT_MODE,
	TMML_AUTO_PLAY,
	TMML_MAX
}TEST_MODE_MEMBER_LIST;

//---------------------------構造体定義---------------------------------------

//---------------------------グローバル変数-----------------------------------

//---------------------------プロトタイプ宣言---------------------------------
void InitTestMode();
void UninitTestMode();
void UpdateTestMode();
void DrawTestMode();

//------------------------------------------------------------------------------
//	関数名:	GetTestModeMemberStatus
//	引数:	メンバーの番号
//	戻り値:	指定されたメンバーの状態
//	説明:	指定されたメンバーの状態を取得する
//------------------------------------------------------------------------------
bool GetTestModeMemberStatus(int nNum);

//------------------------------------------------------------------------------
//	関数名:	GetTestModeMemberStatus
//	引数:	メンバーの番号	フラグ状態
//	戻り値:	なし
//	説明:	指定されたメンバーの状態を設定する
//------------------------------------------------------------------------------
void SetTestModeMemberStatus(int nNum, bool bStatus);

#endif // !TEST_MODE_H

