#ifndef TIMER_H
#define TIMER_H

void InitTimer();
void UpdateTimer();	

//------------------------------------------------------------------------------
//	関数名:	GetTimer
//	引数:	なし	
//	戻り値:	タイマーの値(ms)
//	説明:	タイマーの値の取得
//------------------------------------------------------------------------------
int GetTimer();

//------------------------------------------------------------------------------
//	関数名:	SetTimer
//	引数:	タイマーの値(ms)	
//	戻り値:	なし
//	説明:	タイマーの値の設定
//------------------------------------------------------------------------------
void SetTimer(int nTime);

void DrawTimer();
#endif